GopalSaraf/Practicals/PSDL/include/proc/pic16f15254.inc
// Register: NVMADRH
#define NVMADRH NVMADRH
NVMADRH                                  equ 081Bh
// bitfield definitions
NVMADRH_NVMADRH_POSN                     equ 0000h
NVMADRH_NVMADRH_POSITION                 equ 0000h
NVMADRH_NVMADRH_SIZE                     equ 0007h
NVMADRH_NVMADRH_LENGTH                   equ 0007h
NVMADRH_NVMADRH_MASK                     equ 007Fh

// Register: NVMDATL
#define NVMDATL NVMDATL
NVMDATL                                  equ 081Ch
// bitfield definitions
NVMDATL_NVMDATL_POSN                     equ 0000h
NVMDATL_NVMDATL_POSITION                 equ 0000h
NVMDATL_NVMDATL_SIZE                     equ 0008h
NVMDATL_NVMDATL_LENGTH                   equ 0008h
NVMDATL_NVMDATL_MASK                     equ 00FFh

// Register: NVMDATH
#define NVMDATH NVMDATH
NVMDATH                                  equ 081Dh
// bitfield definitions
NVMDATH_NVMDATH_POSN                     equ 0000h
NVMDATH_NVMDATH_POSITION                 equ 0000h
NVMDATH_NVMDATH_SIZE                     equ 0006h
NVMDATH_NVMDATH_LENGTH                   equ 0006h
NVMDATH_NVMDATH_MASK                     equ 003Fh

// Register: NVMCON1
#define NVMCON1 NVMCON1
NVMCON1                                  equ 081Eh
// bitfield definitions
NVMCON1_RD_POSN                          equ 0000h
NVMCON1_RD_POSITION                      equ 0000h
NVMCON1_RD_SIZE                          equ 0001h
NVMCON1_RD_LENGTH                        equ 0001h
NVMCON1_RD_MASK                          equ 0001h
NVMCON1_WR_POSN                          equ 0001h
NVMCON1_WR_POSITION                      equ 0001h
NVMCON1_WR_SIZE                          equ 0001h
NVMCON1_WR_LENGTH                        equ 0001h
NVMCON1_WR_MASK                          equ 0002h
NVMCON1_WREN_POSN                        equ 0002h
NVMCON1_WREN_POSITION                    equ 0002h
NVMCON1_WREN_SIZE                        equ 0001h
NVMCON1_WREN_LENGTH                      equ 0001h
NVMCON1_WREN_MASK                        equ 0004h
NVMCON1_WRERR_POSN                       equ 0003h
NVMCON1_WRERR_POSITION                   equ 0003h
NVMCON1_WRERR_SIZE                       equ 0001h
NVMCON1_WRERR_LENGTH                     equ 0001h
NVMCON1_WRERR_MASK                       equ 0008h
NVMCON1_FREE_POSN                        equ 0004h
NVMCON1_FREE_POSITION                    equ 0004h
NVMCON1_FREE_SIZE                        equ 0001h
NVMCON1_FREE_LENGTH                      equ 0001h
NVMCON1_FREE_MASK                        equ 0010h
NVMCON1_LWLO_POSN                        equ 0005h
NVMCON1_LWLO_POSITION                    equ 0005h
NVMCON1_LWLO_SIZE                        equ 0001h
NVMCON1_LWLO_LENGTH                      equ 0001h
NVMCON1_LWLO_MASK                        equ 0020h
NVMCON1_NVMREGS_POSN                     equ 0006h
NVMCON1_NVMREGS_POSITION                 equ 0006h
NVMCON1_NVMREGS_SIZE                     equ 0001h
NVMCON1_NVMREGS_LENGTH                   equ 0001h
NVMCON1_NVMREGS_MASK                     equ 0040h

// Register: NVMCON2
#define NVMCON2 NVMCON2
NVMCON2                                  equ 081Fh
// bitfield definitions
NVMCON2_NVMCON2_POSN                     equ 0000h
NVMCON2_NVMCON2_POSITION                 equ 0000h
NVMCON2_NVMCON2_SIZE                     equ 0008h
NVMCON2_NVMCON2_LENGTH                   equ 0008h
NVMCON2_NVMCON2_MASK                     equ 00FFh

// Register: OSCCON
#define OSCCON OSCCON
OSCCON                                   equ 088Eh
// bitfield definitions
OSCCON_COSC_POSN                         equ 0004h
OSCCON_COSC_POSITION                     equ 0004h
OSCCON_COSC_SIZE                         equ 0002h
OSCCON_COSC_LENGTH                       equ 0002h
OSCCON_COSC_MASK                         equ 0030h
OSCCON_NDIV0_POSN                        equ 0000h
OSCCON_NDIV0_POSITION                    equ 0000h
OSCCON_NDIV0_SIZE                        equ 0001h
OSCCON_NDIV0_LENGTH                      equ 0001h
OSCCON_NDIV0_MASK                        equ 0001h
OSCCON_NDIV1_POSN                        equ 0001h
OSCCON_NDIV1_POSITION                    equ 0001h
OSCCON_NDIV1_SIZE                        equ 0001h
OSCCON_NDIV1_LENGTH                      equ 0001h
OSCCON_NDIV1_MASK                        equ 0002h
OSCCON_NDIV2_POSN                        equ 0002h
OSCCON_NDIV2_POSITION                    equ 0002h
OSCCON_NDIV2_SIZE                        equ 0001h
OSCCON_NDIV2_LENGTH                      equ 0001h
OSCCON_NDIV2_MASK                        equ 0004h
OSCCON_NDIV3_POSN                        equ 0003h
OSCCON_NDIV3_POSITION                    equ 0003h
OSCCON_NDIV3_SIZE                        equ 0001h
OSCCON_NDIV3_LENGTH                      equ 0001h
OSCCON_NDIV3_MASK                        equ 0008h
OSCCON_NOSC0_POSN                        equ 0004h
OSCCON_NOSC0_POSITION                    equ 0004h
OSCCON_NOSC0_SIZE                        equ 0001h
OSCCON_NOSC0_LENGTH                      equ 0001h
OSCCON_NOSC0_MASK                        equ 0010h
OSCCON_NOSC1_POSN                        equ 0005h
OSCCON_NOSC1_POSITION                    equ 0005h
OSCCON_NOSC1_SIZE                        equ 0001h
OSCCON_NOSC1_LENGTH                      equ 0001h
OSCCON_NOSC1_MASK                        equ 0020h
OSCCON_NOSC2_POSN                        equ 0006h
OSCCON_NOSC2_POSITION                    equ 0006h
OSCCON_NOSC2_SIZE                        equ 0001h
OSCCON_NOSC2_LENGTH                      equ 0001h
OSCCON_NOSC2_MASK                        equ 0040h

// Register: OSCSTAT
#define OSCSTAT OSCSTAT
OSCSTAT                                  equ 0890h
// bitfield definitions
OSCSTAT_SFOR_POSN                        equ 0001h
OSCSTAT_SFOR_POSITION                    equ 0001h
OSCSTAT_SFOR_SIZE                        equ 0001h
OSCSTAT_SFOR_LENGTH                      equ 0001h
OSCSTAT_SFOR_MASK                        equ 0002h
OSCSTAT_ADOR_POSN                        equ 0002h
OSCSTAT_ADOR_POSITION                    equ 0002h
OSCSTAT_ADOR_SIZE                        equ 0001h
OSCSTAT_ADOR_LENGTH                      equ 0001h
OSCSTAT_ADOR_MASK                        equ 0004h
OSCSTAT_LFOR_POSN                        equ 0004h
OSCSTAT_LFOR_POSITION                    equ 0004h
OSCSTAT_LFOR_SIZE                        equ 0001h
OSCSTAT_LFOR_LENGTH                      equ 0001h
OSCSTAT_LFOR_MASK                        equ 0010h
OSCSTAT_MFOR_POSN                        equ 0005h
OSCSTAT_MFOR_POSITION                    equ 0005h
OSCSTAT_MFOR_SIZE                        equ 0001h
OSCSTAT_MFOR_LENGTH                      equ 0001h
OSCSTAT_MFOR_MASK                        equ 0020h
OSCSTAT_HFOR_POSN                        equ 0006h
OSCSTAT_HFOR_POSITION                    equ 0006h
OSCSTAT_HFOR_SIZE                        equ 0001h
OSCSTAT_HFOR_LENGTH                      equ 0001h
OSCSTAT_HFOR_MASK                        equ 0040h

// Register: OSCEN
#define OSCEN OSCEN
OSCEN                                    equ 0891h
// bitfield definitions
OSCEN_ADOEN_POSN                         equ 0002h
OSCEN_ADOEN_POSITION                     equ 0002h
OSCEN_ADOEN_SIZE                         equ 0001h
OSCEN_ADOEN_LENGTH                       equ 0001h
OSCEN_ADOEN_MASK                         equ 0004h
OSCEN_LFOEN_POSN                         equ 0004h
OSCEN_LFOEN_POSITION                     equ 0004h
OSCEN_LFOEN_SIZE                         equ 0001h
OSCEN_LFOEN_LENGTH                       equ 0001h
OSCEN_LFOEN_MASK                         equ 0010h
OSCEN_MFOEN_POSN                         equ 0005h
OSCEN_MFOEN_POSITION                     equ 0005h
OSCEN_MFOEN_SIZE                         equ 0001h
OSCEN_MFOEN_LENGTH                       equ 0001h
OSCEN_MFOEN_MASK                         equ 0020h
OSCEN_HFOEN_POSN                         equ 0006h
OSCEN_HFOEN_POSITION                     equ 0006h
OSCEN_HFOEN_SIZE                         equ 0001h
OSCEN_HFOEN_LENGTH                       equ 0001h
OSCEN_HFOEN_MASK                         equ 0040h

